### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.backend_func.module.cdc_backend_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Web/sites/io-p-itn-cdc-backend-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "CDC"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CDC"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cdc/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "[REDACTED]"
            "hidden-link: /app-insights-instrumentation-key" = "[REDACTED]"
            "hidden-link: /app-insights-resource-id"         = "[REDACTED]"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.backend_func.module.apim_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-cdc-rg-01|io-p-itn-cdc-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow io-p-itn-platform-api-gateway-apim-01 to read secrets"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1ff61bad-d412-44d8-987c-9bd53fb54b84"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (sensitive value)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_monitor_diagnostic_setting.queue_diagnostic_setting,
  on cdc_alerts.tf line 401, in resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting":
 401: resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and 4 more similar warnings elsewhere)
```

</details>
